{"type":"data","nodes":[null,{"type":"data","data":[{"post":1},{"slug":2,"title":3,"date":4,"github":5,"html":6},"orpheus","Orpheus audio player","2025-10-10","https://github.com/stkivv/orpheus-player","\u003Cp>This is a desktop application for playing audio files that I made using Electron and Vue. It was my first time using Electron and this was largely a learning experience, which I undertook due to my curiosity for the technology. Vue was not entirely new to me, I had briefly used it in my university Javascript course, but I wanted to refresh my knowledge.\u003C/p>\n\u003Cp>What makes this application different from many others of its kind is the extent to which the user is able to customize the app&#39;s UI - the color of any given UI element can be changed to whatever hex value the user wants.\u003C/p>\n\u003Ch1>Thoughts on Electron\u003C/h1>\n\u003Cp>I had a lot of fun making this project and I found Electron to be quite intuitive. I am aware that Electron is often criticized for large file sizes and high memory usage, but being able to write cross-platform desktop applications with web technology is very neat in my opinion. I think there are some contexts where it might make sense to use Electron over something like Flutter. For example when you already have a web application and you want to create a desktop version for it, then using Electron would likely result in much quicker development.\u003C/p>\n\u003Ch1>Closing thoughts\u003C/h1>\n\u003Cp>The project in its current state is what I would call a minimum viable product and I will certainly keep developing this in the future. I have listed a few potential developments I have considered for the future below:\u003C/p>\n\u003Cul>\n\u003Cli>external audio sources\u003C/li>\n\u003Cli>support for multiple audio sources\u003C/li>\n\u003Cli>support for file tags\u003C/li>\n\u003Cli>search, sort, filtering for tracks\u003C/li>\n\u003Cli>more customization options\u003C/li>\n\u003C/ul>\n\u003Ch1>Screenshots\u003C/h1>\n\u003Cp>\u003Cimg src=\"/images/orpheus/orpheus-main.webp\" alt=\"screenshot\">\n\u003Cimg src=\"/images/orpheus/orpheus-navy.webp\" alt=\"screenshot\">\n\u003Cimg src=\"/images/orpheus/oprheus-settings.webp\" alt=\"screenshot\">\u003C/p>\n"],"uses":{"params":["slug"]}}]}
